## pandas

In [2]:
import numpy as np
import pandas as pd

In [4]:
labels=['a','b','c']
my_data=[10,20,30]
arr=np.array(my_data)
d={'a':10,'b':20,'c':30}

In [8]:
labels

['a', 'b', 'c']

In [7]:
my_data

[10, 20, 30]

In [9]:
arr

array([10, 20, 30])

In [10]:
d

{'a': 10, 'b': 20, 'c': 30}

In [41]:
pd.Series(my_data)

0    10
1    20
2    30
dtype: int64

In [10]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

HERE WE can even go without specifying that is data or index just go in specific order

we can also create series using numpy arrays

In [11]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [12]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

Even numpy arrays can have labels and can also be used to create series

In [13]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

can also be made by dictionaries

In [14]:
ser1=pd.Series([1,2,3,4],['USA','Russia','India','China'])

In [15]:
ser1

USA       1
Russia    2
India     3
China     4
dtype: int64

In [16]:
ser2=pd.Series([1,2,5,4],['USA','Canada','Germany','India'])

In [17]:
ser2

USA        1
Canada     2
Germany    5
India      4
dtype: int64

In [18]:
ser1['USA']

1

In [19]:
ser1+ser2

Canada     NaN
China      NaN
Germany    NaN
India      7.0
Russia     NaN
USA        2.0
dtype: float64

# Data Frames in Pandas

In [20]:
from numpy.random import randn

In [21]:
np.random.seed(101)

In [22]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [24]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

each of w,x,y,z is pandas series which shares common indes a,b,c,d,e and 5,4 is size of data that is directly supplied by randn

In [25]:
print(df['W'])
type(df['W'])

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

pandas.core.series.Series

here df['w'] is a series

In [15]:
type(df)

pandas.core.frame.DataFrame

here df is data frame so both data frame is diffrent

In [16]:
df['A']=df['W']+df['X']

In [17]:
df

          W         X         Y         Z         A
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [22]:
df.drop('A')

          W         X         Y         Z         A
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

the error occurs because we have not set the axis=1 here axis is set to 0 which means that we are dropping row so axis =1 needs to be set

In [21]:
df.drop('A',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [26]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

here df is back with a we need to set inplace as True so that we donot loose data

In [26]:
df.drop('A',axis=1,inplace=True)

In [27]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

we have deleted the column (series) now

In [29]:
df.drop('E')

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

here no need to set axis already 0 so row deleted

In [30]:
df.shape

(5, 4)

In [32]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

HERE WE SEE THAT IT RETURN ROWS THAT TWO IN SERIES THEREFORE ROWS IS ALSO A SERIES

In [34]:
df.iloc[0]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

here index based location iloc here we pass index of location

In [36]:
df.loc['A','W']

2.706849839399938

In [37]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

# BOOLEAN DATAFRAMES

In [38]:
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

data frame grater than 0 true

In [40]:
booldf=df[df>0]

In [41]:
booldf

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

nan is case of false

In [45]:
df[df['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [28]:
df[df['X']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [31]:
resultdf=df[df['W']>0]

In [33]:
resultdf

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [35]:
resultdf['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

all these can be done in one step

In [37]:
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

FIRST IT RETURNS THE DATA FRAME AND THAN THAT OF X SO WE GET SERIES

In [41]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [44]:
df[(df['W']>0) and (df['W']<1)]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

here you see there is an error this indicates that python and cannot be used here as it compares true and false so here we have to use &

In [48]:
df[(df['W']>0)&(df['Y']<0)]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

simultaneously checking two condition

In [3]:
panda=pd.read_csv("insurance.csv")

In [4]:
panda

      x      y
0   108  392.5
1    19   46.2
2    13   15.7
3   124  422.2
4    40  119.4
..  ...    ...
58    9   87.4
59   31  209.8
60   14   95.5
61   53  244.6
62   26  187.5

[63 rows x 2 columns]

In [7]:
x=panda['x']

In [8]:
x

0     108
1      19
2      13
3     124
4      40
     ...
58      9
59     31
60     14
61     53
62     26
Name: x, Length: 63, dtype: int64